<!-- HEAD + HTML Open -->
<?php include('inc/head.php'); ?>
<!-- <body><div class="wrapper"> -->
<?php include('inc/body-open.php'); ?>
<!-- HEADER -->
<?php include('inc/header.php'); ?>

<!-- MAIN -->
<main class="page page_single-article transition-fade" id="swup">
  <article class="single-article" g-component="AllInOne">
    <div class="single-article__container">
      <header class="single-article__cover article-header">
        <div class="article-header__content">
          <div class="article-header__info">
            <span class="article-header__tag tag">Стаття</span>
            <hr class="separator separator_vertical h-6">
            <span class="article-header__date p6">30 вересня</span>
          </div>
          <h1 class="article-header__title h2">Топ-15 трендів у веб дизайні 2023 року</h1>
        </div>
        <div class="article-header__image">
          <div class="article-header__image-wrapper -ibg">
            <img src="images/article/cover.jpg" alt="Cover">
          </div>
          <address class="article-header__author">
            Автор:
            <a rel="author" href="https://synchronized.studio" class="author">synchronized</a>
          </address>
        </div>
      </header>

      <div class="single-article__content article-content">

        <div>
          <p>Веб-дизайн пройшов величезний шлях за останні кілька років. Ця практика існує на стику творчості і технологій – двох найбільш швидких галузей, що розвиваються у світі, тому не дивно, що в веб-дизайні постійно з’являються нові тренди. Отже, які ж останні тенденції в веб-дизайні?</p>

          <ol>
            <li>темна колірна схема;</li>
            <li>колаж;</li>
            <li>антидизайн;</li>
            <li>мінімалізм;</li>
            <li>органічний дизайн;</li>
            <li>ілюстрації;</li>
            <li>функціональність, інклюзивність і доступність; </li>
            <li>моушн-дизайн і інтерактивність;</li>
            <li>3D і геометричний дизайн.</li>
          </ol>

          <p>У веб-дизайні завжди будуть підходи, які залишаються надовго, наприклад, зручна для користувача навігація, безпека даних, швидке завантаження сторінок. А модні тренди будуть приходити і йти. При цьому якщо ви в курсі останніх тенденцій, стилів і інновацій, ваш сайт завжди буде виділятися серед інших навіть за умови, що онлайн-екосистема постійно змінюється.</p>
        </div>

        <section>
          <div>
            <h2>1. Темна колірна схема</h2>

            <figure>
              <img src="images/article/1.jpg" alt="#">
              <figcaption>Темна колірна схема – головна сторінка <cite>apple</cite></figcaption>
            </figure>

            <p>Довгий час в веб-дизайні білий фон вважався єдиним способом створити вільний простір на сайті або в додатку. Кілька років тому дизайнери почали додавати темніші елементи і теми, в 2021 році цей тренд захопив індустрію, і ми очікуємо, що він збережеться і в 2022 році.</p>
          </div>

          <div>
            <h3>Що таке темна колірна схема?</h3>

            <figure class="figure-image-left">
              <div>
                <img src="images/article/2.jpg" alt="#">
                <figcaption>Темна колірна схема – <cite>clock strikes twelve</cite></figcaption>
              </div>
              <p>Великі бренди, такі як <a href="#">Apple</a>, <a href="#">Hublot</a>, і окремі дизайнери, наприклад, Clock Strikes Twelve, для своїх продуктів і портфоліо використовують темний фон, так як це відмінний спосіб зробити сайт сучасним і елегантним. Крім того, що дизайнери можуть в цьому випадку пограти з різними елементами, такими як пастель або неон (два головних тренда 2020 року), дослідження також показали, що темний режим менше витрачає заряд пристрою, крім того, він краще підходить для сприйняття, оскільки зменшує негативний вплив синього кольору на зір людини.</p>
            </figure>

            <p>«Схоже, сьогодні з’являється більше продуктів, які мають в налаштуваннях темний режим або орієнтовані тільки на темну колірну схему, це продиктовано дослідженнями, в яких вивчили вплив яскравого синього світла на людину, а також на час автономної роботи батареї» , – каже UI-дизайнер з Envato Шон Фіхан.

              Темний режим не тільки елегантний і приємний для очей, він також збільшує контраст і робить елементи дизайну більш помітними. Ви навіть можете додати на свій сайт перемикач темного режиму, як показано в цих прикладах від <a href="#">Johny Vino</a>, <a href="#">Koos Looijesteijn</a> і <a href="#">Adrian Verde Studio</a>, щоб відвідувачі могли налаштовувати сайт під себе.</p>

            <blockquote>
              <p>Темний фоновий режим – виразна тенденція, яка зробила найбільший вплив на веб-дизайн. Завдяки тому, що темний режим став популярним, я вже бачила кілька сайтів, де був доданий перемикач від світлого до темного.</p>
              <cite>— Талія Джаннополас, UX-дизайнер з Envato</cite>
            </blockquote>

            <p>Все більше і більше неоморфних варіантів з суперечливим UX-дизайном, заснованим на скевоморфізмі і flat дизайні (такі приклади часто зустрічаються в інтерфейсі iOS або Android), включають опцію темного фону, незважаючи на те що спочатку створювалися з використанням виключно білих і світлих колірних схем.</p>
          </div>
        </section>

        <section>

          <div>
            <h2>2. Колаж і змішані техніки</h2>

            <p>Колаж – одна з найбільш популярних тенденцій цього року в графічному дизайні і в соціальних мережах, цей тренд швидко завоював популярність і в світі веб-дизайну. Змішана техніка знову в центрі уваги завдяки художникам зі світу digital і інфлюенсерам, його також взяли багато брендів і веб-дизайнери, включаючи Chobani, City Circus і Urban Outfitters.</p>
          </div>

          <div>
            <h3>Що ж таке колаж?</h3>

            <figure class="figure-image-right">
              <div>
                <img src="images/article/3.jpg" alt="#">
                <figcaption>Приклад колажу</figcaption>
              </div>
              <p>Колаж – це поєднання фотографій, ілюстрацій, графіки, елементів, що рухаються і тексту, його застосовують для створення надихаючої і привертаючої уваги естетики.

                Тепер, коли колаж перейшов в цифрову сферу, він еволюціонував, з’явилися нові елементи: анімовані колажі, величезні декоративні шрифти, художні текстури (такі як мазки пензлем) і навіть анімований спотворений текст, все це дає неймовірні результати.

                Колаж – це тренд, який добре поєднується з мінімалістичним UX-дизайном або навіть Антидизайном, якщо ви готові вийти за рамки звичного. Інтеграція змішаної техніки і колажів в дизайн вашого сайту – хороший спосіб додати яскравості і креативності та таким чином виділити свій бренд.</p>
            </figure>

            <figure>
              <iframe src="https://www.youtube.com/watch?v=7y7bZdTRNP4&list=PLJCXrsW_esBlb1BYfeNhY4kJQuNYoDpF_&index=32" frameborder="0"></iframe>
              <figcaption>Відео: Колажі в сучасному дизайні</figcaption>
            </figure>

            <p>Все більше і більше неоморфних варіантів з суперечливим UX-дизайном, заснованим на скевоморфізмі і flat дизайні (такі приклади часто зустрічаються в інтерфейсі iOS або Android), включають опцію темного фону, незважаючи на те що спочатку створювалися з використанням виключно білих і світлих колірних схем.</p>
          </div>
        </section>

        <section>
          <div>
            <h2>3. Функціональність, а також інклюзивний і доступний дизайн</h2>

            <p>На щастя, такий веб-дизайн вже використовують багато брендів і компанії, такі як електронна платформа для торгівлі Blue Receipt і бренд котячого корму Cat Person. Функціональний, доступний і зручний сайт, де будь-який відвідувач може легко розібратися, тепер необхідний, щоб забезпечити ефективне онлайн-взаємодія.</p>

            <figure>
              <img src="images/article/5.jpg" alt="#">
              <figcaption>Представлення полів форми</figcaption>
            </figure>

            <p>На щастя, такий веб-дизайн вже використовують багато брендів і компанії, такі як електронна платформа для торгівлі Blue Receipt і бренд котячого корму Cat Person. Функціональний, доступний і зручний сайт, де будь-який відвідувач може легко розібратися, тепер необхідний, щоб забезпечити ефективне онлайн-взаємодія.

              Більш зрозумілий, інклюзивний дизайн важливий не тільки для хорошого клієнтського сервісу, це також збільшує конверсію, просуває ваш сайт і дає більшу аудиторію.

              Ось кілька способів зробити ваш сайт більш доступним:</p>
            <ul>
              <li>зробіть сильний кольоровий контраст між текстом і фоном;</li>
              <li>додайте індикатори фокуса, наприклад, прямокутний контур, який з’являється навколо посилань при використанні навігації з клавіатури;</li>
              <li>застосовуйте лейбли і підказки в полях форми, а не плейсхолдери з малозрозумілими коментарями;</li>
              <li>задійте функціональні ALT-теги (альтернативні тексти) для зображень;</li>
              <li>використовуйте легкий для розуміння контент без сленгу.</li>
            </ul>

            <blockquote class="blockquote-smaller">
              <p>В цілому, я бачу, як реально виріс рівень, з’явилося багато добре опрацьованих, функціональних і доступних сайтів, і це чудово. Я прийшов до такої думки, коли помітив, що на сайтах стали використовувати більш контрастні кольори, велику типографіку, автентичний контент, великі кнопки і м’які вигнуті елементи інтерфейсу. Я вірю, що це все відбувається завдяки тому, що росте розуміння і визнання тієї цінності</p>
              <cite>— Талія Джаннополас, UX-дизайнер з Envato</cite>
            </blockquote>

            <p>Якщо ви вже втілили ці мінімальні зміни, то закріпіть принципи доступності в дизайн-системі для розробників. Тоді ви розв’язуєте не проблему продукту, а налагоджуєте процес — а це безцінно для потенційно світлого майбутнього та переходу до аксесибіліті як частини вашої дизайн-системи.</p>
          </div>

          <div>
            <h3>Практика вебдоступності</h3>

            <p>Вони є основою вебдоступності, роблять вебінтерфейси цілісними, допомагають пріоритезувати певні речі, перевірити відповідність законодавчим нормам тощо.

              Є стандарти, присвячені фізичним девайсам і обладнанню, програмному забезпеченню і вебконтенту. Ми зосередимось на останньому. Ось три абревіатури, які потрібно запам’ятати:</p>
            <figure>
              <table>
                <caption>Розшифрування абревіатур</caption>
                <thead>
                  <tr>
                    <th>Аббревіатура</th>
                    <th>Розшифрування</th>
                  </tr>
                </thead>
                <tr>
                  <td>Web Accessibility Initiative (WAI)</td>
                  <td>це організація, що пише та видає гайдлайни про доступність, котрі вже стали стандартами.</td>
                </tr>
                <tr>
                  <td>WAI-ARIA</td>
                  <td>набір стандартів, запущений у 2014 році у відповідь на те, що сайти стали масово використовувати складні інтерактивні елементи, які не є доступними для всіх. Це стосується, наприклад, технології Drag-and-drop або таймерів зворотного відліку.</td>
                </tr>
                <tr>
                  <td>WCAG</td>
                  <td>це основа всієї галузі вебдоступності, набір стандартів, які описують і визначають поведінку контенту. Стосується зображень, звуків, мультимедіа, тексту, структури, коду, візуального дизайну.</td>
                </tr>
              </table>
              <figcaption>Приклад таблиці</figcaption>
            </figure>

            <p>Перші вебстандарти з’явились ще у 1999 році, тож ця тема не нова і багато аргументів на захист вебдоступності вже прозвучали 20 років тому. На сайті Nielsen Norman Group перші статті про це з’явилися теж в 1999, а перше масштабне дослідження та репорт вони зробили в 2001.</p>
          </div>
        </section>

        <section>
          <div>
            <h2>4. Моушн-дизайн і інтерактивність</h2>
            <p>Відео-контент сьогодні привертає інтернет-користувачів більше, ніж інші форми, не дивно, що це стало одним з популярних трендів в веб-дизайні. Моушн-дизайн і анімацію використовують всі: від батькових сайтів, таких як Alter Mind і Gridspace, до великих сервісів з пошуку роботи, таких як SEEK. Це простий спосіб зробити звичайну веб-сторінку більш цікавою.

              Аналогічним чином багато брендів і компанії, такі як YouTube Rewind, почали додавати на сайти більше інтерактивних елементів (вікторини, ігри, квізи і опитування). Відмінний приклад такого підходу – бренд Estee Lauder. На сайті компанії є інтерактивна аркадна гра під назвою «THE ANRCADE», це футуристичний квест, де користувачі заробляють «окуляри молодості», а бренд таким чином просуває свій крем Advanced Night Repair.</p>
            <div class="article-slider__slider swiper">
              <div class="article-slider__wrapper swiper-wrapper">
                <div class="article-slider__slide swiper-slide"></div>
              </div>
              <div class="article-slider__controls">
                <button type="button" class="swiper-button-prev"></button>
                <div class="swiper-pagination"></div>
                <button type="button" class="swiper-button-next"></button>
              </div>
            </div>
            <p>Інтерактивність – це не тільки веселе доповнення до онлайн-досвіду, але і відмінний спосіб привернути ваших відвідувачів, а також дізнатися про них більше. Однак тут важливо зберегти баланс, щоб інтерактивні елементи Моушн-дизайну не переважували і не відволікали користувача від основної мети, заради якої він відвідав ваш сайт.</p>

            <blockquote>
              <p>У міру того, як технології розвиваються, стає все простіше застосовувати Моушн-дизайн, і це допомагає створювати приголомшливі враження. Я бачу, що це добре виходить, коли є перехід між контентом і взаємодією з елементами.</p>
            </blockquote>
          </div>
        </section>

        <section>
          <div>
            <h2>5. 3D і геометричний дизайн</h2>

            <p>Геометричні патерни і елементи часто використовуються в сучасному веб-дизайні, включаючи класичні плоскі форми, такі як багатокутники, прямокутники, трикутники і ромби. Однак цей тренд еволюціонував і тепер включає в себе більш сучасні елементи, такі як тривимірні форми, плаваючі об’єкти і видимі лінії сітки.</p>

            <figure class="article-gallery">
              <div class="article-gallery__grid">
                <img src="images/article/gallery-1.jpg" alt="#">
                <img src="images/article/gallery-2.jpg" alt="#">
                <img src="images/article/gallery-3.jpg" alt="#">
                <img src="images/article/gallery-4.jpg" alt="#">
                <img src="images/article/gallery-5.jpg" alt="#">
              </div>
              <figcaption>Приклади 3D- і геометричного дизайну</figcaption>
            </figure>

            <p>ривимірні форми і плаваючі об’єкти в геометричному дизайні з’являються, завдяки змішанню сюрреалістичних анімацій з реальними об’єктами, таким чином створюється зачаровуючий футуристичний ефект. Цей стиль часто використовується в рекламних роликах для демонстрації нових продуктів, які в цьому випадку обертаються, немов підвішені в повітрі. Щоб ваш сайт залучав відвідувачів, можна додати ще один шар або вимір. Один з таких прикладів – сайт The Artery, який поєднує геометричні елементи з мінімалістичним простими лініями модульної сітки.

              Використання простих ліній сітки, меж та інших структурних елементів також стало трендом в області веб-дизайну. Наприклад, цю тенденцію можна оцінити на сайтах Rail Road Ladies, Monograph Comms і The Imagineers.</p>

            <blockquote>
              <p>У міру того, як технології розвиваються, стає все простіше застосовувати Моушн-дизайн, і це допомагає створювати приголомшливі враження. Я бачу, що це добре виходить, коли є перехід між контентом і взаємодією з елементами.</p>
              <cite>— Талія Джаннополас, UX-дизайнер з Envato</cite>
            </blockquote>

            <p>Використання простих ліній сітки, меж та інших структурних елементів також стало трендом в області веб-дизайну. Наприклад, цю тенденцію можна оцінити на сайтах Rail Road Ladies, Monograph Comms і The Imagineers.</p>
          </div>
        </section>

      </div>

      <footer class="single-article__footer article-footer">
        <strong class="article-footer__fix">Знайшли помилку? Виділіть її та натисніть Ctrl+Enter</strong>
        <ul class="article-footer__tags site-tags">
          <li class="site-tags__list-item site-tag site-tag_design">Дизайн</li>
          <li class="site-tags__list-item site-tag site-tag_dev">Розробка</li>
        </ul>
      </footer>
    </div>
  </article>
  <section class="next-article-sect">
    <div class="next-article-sect__container">
      <h2 class="next-article-sect__title">Наступна стаття</h2>
      <div class="next-article-sect__grid">
        <article class="next-article-sect__grid-item blog-item blog-item_sm">
          <div class="blog-item__col blog-item__col_left">
            <span class="blog-item__tag tag">Стаття</span>
            <a href="javascript:void(0)" class="blog-item__title">
              <h4>Як ми створили якісну платформу LMS для освітніх проектів</h4>
            </a>
            <time pubdate datetime="2022-09-30" class="blog-item__date">30 вересня 2022</time>
          </div>
          <div class="blog-item__col blog-item__col_right">
            <div class="blog-item__image-wrapper -ibg">
              <img src="images/blog/1.jpg" alt="#">
            </div>
          </div>
        </article>
        <div class="next-article-sect__grid-item cta-block cta-block_sm">
          <div class="cta-block__content">
            <h4 class="cta-block__title">Ми ще не співпрацювали?</h4>
            <span class="cta-block__sub-title p6">Не втрачайте час, напишіть нам</span>
            <a href="javascript:void(0)" class="cta-block__link button button_primary"><span>Хочу проєкт</span></a>
          </div>
          <div class="cta-block__image">
            <img src="images/home/shell.png" alt="Shell">
          </div>
        </div>
      </div>
    </div>
  </section>
</main>

<!-- FOOTER -->
<?php include('inc/footer.php'); ?>
<!-- </div class="wrapper"></body> -->
<?php include('inc/body-close.php'); ?>
<!-- POPUP -->
<?php include('inc/popup.php'); ?>
<!-- SCRIPTS + HTML Close -->
<?php include('inc/scripts.php'); ?>